In [2]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
from sklearn.neighbors import KNeighborsClassifier
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import confusion_matrix, classification_report, accuracy_score

In [3]:
df = pd.read_csv("premium_dataset.csv")

In [4]:
df.head()

,id,age,income,city,visits_last_month,avg_session_time,is_premium,churn
0,1,34.0,52000.0,Dhaka,5,12.5,0,1
1,2,NaN,48000.0,Chittagong,3,10.1,1,0
2,3,27.0,61000.0,Sylhet,7,15.2,0,1
3,4,45.0,NaN,Rajshahi,2,8.0,0,0
4,5,22.0,150000.0,Dhaka,12,30.5,1,1

In [5]:
df.shape

(550, 8)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 550 entries, 0 to 549
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 550 non-null    int64
 1   age                542 non-null    float64
 2   income             515 non-null    float64
 3   city               550 non-null    object
 4   visits_last_month  550 non-null    int64
 5   avg_session_time   550 non-null    float64
 6   is_premium         550 non-null    int64
 7   churn              550 non-null    int64
dtypes: float64(3), int64(4), object(1)
memory usage: 34.5+ KB

In [7]:
df.describe()

,id,age,income,visits_last_month,avg_session_time,is_premium,churn
count,550.000000,542.000000,515.000000,550.000000,550.000000,550.000000,550.000000
mean,275.500000,39.354244,79699.029126,3.663636,10.902000,0.414545,0.567273
std,158.915596,12.050263,62845.300607,3.065993,7.675826,0.493092,0.495905
min,1.000000,19.000000,1000.000000,0.000000,1.200000,0.000000,0.000000
25%,138.250000,29.000000,35000.000000,1.000000,4.000000,0.000000,0.000000
50%,275.500000,37.000000,52000.000000,3.000000,8.000000,0.000000,1.000000
75%,412.750000,50.000000,110000.000000,6.000000,14.800000,1.000000,1.000000
max,550.000000,62.000000,500000.000000,12.000000,30.500000,1.000000,1.000000

In [8]:
df.duplicated().sum()

np.int64(0)